# RunBottomHigherThanTopFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..RunBottomHigherThanTopFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The base elevation for the run is higher than the top elevation for the run.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RunBottomHigherThanTopFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RunBottomHigherThanTopFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RunBottomHigherThanTopFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace